[
  {"word": "Dog", "meaning": "سگ", "description": "A domesticated carnivorous mammal that typically has a long snout, an acute sense of smell, and a barking, howling, or whining voice."},
  {"word": "Cat", "meaning": "گربه", "description": "A small domesticated carnivorous mammal with soft fur, a short snout, and retractable claws."},
  {"word": "Lion", "meaning": "شیر", "description": "A large, powerful cat that has a yellowish-brown coat, with the male typically having a mane of long hair."},
  {"word": "Tiger", "meaning": "ببر", "description": "A large cat with a yellow-brown coat striped with black, native to the forests of Asia."},
  {"word": "Elephant", "meaning": "فیل", "description": "A very large plant-eating mammal with a prehensile trunk, long curved ivory tusks, and large ears."},
  {"word": "Giraffe", "meaning": "زرافه", "description": "A large African mammal with a very long neck and forelegs, having a coat patterned with brown patches."},
  {"word": "Monkey", "meaning": "میمون", "description": "A primate, often with a long tail, typically living in trees in tropical countries."},
  {"word": "Horse", "meaning": "اسب", "description": "A large plant-eating domesticated mammal with solid hoofs and a flowing mane and tail."},
  {"word": "Cow", "meaning": "گاو", "description": "A fully grown female animal of a domesticated breed of ox, kept to produce milk or beef."},
  {"word": "Sheep", "meaning": "گوسفند", "description": "A domesticated ruminant animal with a thick woolly coat, kept in flocks for its wool or meat."},
  {"word": "Goat", "meaning": "بز", "description": "A hardy domesticated ruminant animal that has backward-curving horns and (in the male) a beard."},
  {"word": "Pig", "meaning": "خوک", "description": "An omnivorous domesticated hoofed mammal with sparse bristly hair and a flat snout."},
  {"word": "Chicken", "meaning": "مرغ", "description": "A domestic fowl kept for its eggs or meat, especially a young one."},
  {"word": "Duck", "meaning": "اردک", "description": "A waterbird with a broad flat bill, short legs, webbed feet, and a waddling gait."},
  {"word": "Eagle", "meaning": "عقاب", "description": "A large bird of prey with a massive hooked bill and long broad wings."},
  {"word": "Owl", "meaning": "جغد", "description": "A nocturnal bird of prey with large forward-facing eyes surrounded by facial disks."},
  {"word": "Snake", "meaning": "مار", "description": "A long limbless reptile which has no eyelids, a short tail, and jaws that are capable of considerable extension."},
  {"word": "Crocodile", "meaning": "تمساح", "description": "A large predatory semiaquatic reptile with long jaws, long tail, short legs, and a horny textured skin."},
  {"word": "Turtle", "meaning": "لاک پشت", "description": "A slow-moving reptile, enclosed in a scaly or leathery domed shell into which it can retract its head and thick legs."},
  {"word": "Frog", "meaning": "قورباغه", "description": "A tailless amphibian with a short squat body, moist smooth skin, and very long hind legs for leaping."},
  {"word": "Fish", "meaning": "ماهی", "description": "A limbless cold-blooded vertebrate animal with gills and fins living wholly in water."},
  {"word": "Shark", "meaning": "کوسه", "description": "A long-bodied chiefly marine fish with a cartilaginous skeleton, a prominent dorsal fin, and toothlike scales."},
  {"word": "Dolphin", "meaning": "دلفین", "description": "A small gregarious toothed whale with a beaklike snout and a curved fin on the back."},
  {"word": "Whale", "meaning": "نهنگ", "description": "A very large marine mammal with a streamlined hairless body, a horizontal tail fin, and a blowhole on top of the head for breathing."},
  {"word": "Butterfly", "meaning": "پروانه", "description": "A nectar-feeding insect with two pairs of large, typically brightly colored wings that are covered with microscopic scales."},
  {"word": "Bee", "meaning": "زنبور عسل", "description": "A winged insect that collects nectar and pollen, produces wax and honey, and lives in large communities."},
  {"word": "Ant", "meaning": "مورچه", "description": "A small insect typically living in a highly organized colony with a division of labor for males, females, and workers."},
  {"word": "Spider", "meaning": "عنکبوت", "description": "An eight-legged predatory arachnid with an unsegmented body consisting of a fused head and thorax and a rounded abdomen."},
  {"word": "Wolf", "meaning": "گرگ", "description": "A wild carnivorous mammal which is the largest member of the dog family."},
  {"word": "Fox", "meaning": "روباه", "description": "A carnivorous mammal with a pointed muzzle and bushy tail, known for its cunning."},
  {"word": "Bear", "meaning": "خرس", "description": "A large, heavy mammal with thick fur and a very short tail, walking on the soles of its feet."},
  {"word": "Deer", "meaning": "گوزن", "description": "A hoofed grazing or browsing animal, with branched bony antlers that are shed annually."},
  {"word": "Rabbit", "meaning": "خرگوش", "description": "A small mammal with long ears, long hind legs, and a short tail, living in burrows."},
  {"word": "Squirrel", "meaning": "سنجاب", "description": "An agile tree-dwelling rodent with a bushy tail, typically feeding on nuts and seeds."},
  {"word": "Kangaroo", "meaning": "کانگورو", "description": "A large plant-eating marsupial with a long powerful tail and strongly developed hind limbs."},
  {"word": "Penguin", "meaning": "پنگوئن", "description": "A flightless bird of the southern hemisphere, with black upper parts and white underparts."},
  {"word": "Camel", "meaning": "شتر", "description": "A large, long-necked ungulate mammal with one or two humps on its back."},
  {"word": "Zebra", "meaning": "گورخر", "description": "An African wild horse with black-and-white stripes and an erect mane."},
  {"word": "Hippopotamus", "meaning": "اسب آبی", "description": "A large thick-skinned semiaquatic African mammal, with massive jaws and large tusks."},
  {"word": "Rhinoceros", "meaning": "کرگدن", "description": "A large, heavily built plant-eating mammal with one or two horns on the nose and thick folded skin."},
  {"word": "Gorilla", "meaning": "گوریل", "description": "A powerfully built great ape with a large head and short neck, found in the forests of central Africa."},
  {"word": "Chimpanzee", "meaning": "شامپانزه", "description": "A great ape with large ears, mainly black coloration, and lighter skin on the face."},
  {"word": "Parrot", "meaning": "طوطی", "description": "A bird, often vividly colored, with a short downcurved hooked bill, grasping feet, and a raucous voice."},
  {"word": "Swan", "meaning": "قو", "description": "A large waterbird with a long flexible neck, short legs, webbed feet, a broad bill, and typically all-white plumage."},
  {"word": "Peacock", "meaning": "طاووس", "description": "A male bird with very long tail feathers that can be erected and expanded in display."},
  {"word": "Bat", "meaning": "خفاش", "description": "A nocturnal flying mammal that navigates by echolocation and feeds on insects or fruit."},
  {"word": "Seal", "meaning": "فک", "description": "A fish-eating aquatic mammal with a streamlined body and feet developed as flippers."},
  {"word": "Octopus", "meaning": "هشت پا", "description": "A cephalopod mollusk with eight sucker-bearing arms, a soft sac-like body, and strong beak-like jaws."},
  {"word": "Lobster", "meaning": "خرچنگ دریایی", "description": "A large marine crustacean with a cylindrical body, stalked eyes, and five pairs of legs."},
  {"word": "Crab", "meaning": "خرچنگ", "description": "A crustacean with a broad carapace, stalked eyes, and five pairs of legs, the first pair of which are modified as pincers."}
]
