[
  {"word": "Head", "meaning": "سر", "description": "The upper part of the human body containing the brain, eyes, ears, nose, and mouth."},
  {"word": "Eye", "meaning": "چشم", "description": "The organ of sight in humans and animals."},
  {"word": "Ear", "meaning": "گوش", "description": "The organ of hearing and balance in humans and other vertebrates."},
  {"word": "Nose", "meaning": "بینی", "description": "The part projecting above the mouth on the face, used for breathing and smelling."},
  {"word": "Mouth", "meaning": "دهان", "description": "The opening in the face used for speaking, eating, and breathing."},
  {"word": "Tooth", "meaning": "دندان", "description": "A hard, calcified structure found in the jaws used for breaking down food."},
  {"word": "Tongue", "meaning": "زبان", "description": "The muscular organ in the mouth used for tasting, swallowing, and speaking."},
  {"word": "Neck", "meaning": "گردن", "description": "The part of the body that connects the head to the rest of the body."},
  {"word": "Shoulder", "meaning": "شانه", "description": "The joint connecting the arm with the torso."},
  {"word": "Arm", "meaning": "بازو", "description": "The upper limb of the human body from the shoulder to the hand."},
  {"word": "Elbow", "meaning": "آرنج", "description": "The joint between the upper arm and the forearm."},
  {"word": "Wrist", "meaning": "مچ دست", "description": "The joint connecting the hand with the forearm."},
  {"word": "Hand", "meaning": "دست", "description": "The end part of the arm beyond the wrist, including the fingers and thumb."},
  {"word": "Finger", "meaning": "انگشت دست", "description": "Any of the four slender jointed parts attached to either hand."},
  {"word": "Thumb", "meaning": "انگشت شست", "description": "The short, thick first digit of the human hand."},
  {"word": "Chest", "meaning": "قفسه سینه", "description": "The front surface of a person's body between the neck and the abdomen."},
  {"word": "Back", "meaning": "کمر", "description": "The rear surface of the human body from the shoulders to the hips."},
  {"word": "Stomach", "meaning": "معده", "description": "The internal organ in which the major part of the digestion of food occurs."},
  {"word": "Abdomen", "meaning": "شکم", "description": "The part of the body containing the digestive organs."},
  {"word": "Hip", "meaning": "لگن", "description": "The projecting part of each side of the body formed by the side of the pelvis."},
  {"word": "Leg", "meaning": "پا", "description": "Each of the limbs on which a person walks and stands."},
  {"word": "Knee", "meaning": "زانو", "description": "The joint between the thigh and the lower leg."},
  {"word": "Ankle", "meaning": "مچ پا", "description": "The joint connecting the foot with the leg."},
  {"word": "Foot", "meaning": "پا", "description": "The lower extremity of the leg below the ankle, on which a person stands."},
  {"word": "Toe", "meaning": "انگشت پا", "description": "Any of the five digits at the end of the human foot."},
  {"word": "Heart", "meaning": "قلب", "description": "The organ that pumps blood through the circulatory system."},
  {"word": "Lung", "meaning": "ریه", "description": "Each of the pair of organs in the chest involved in breathing."},
  {"word": "Liver", "meaning": "کبد", "description": "A large organ that cleans the blood and produces bile."},
  {"word": "Kidney", "meaning": "کلیه", "description": "Each of a pair of organs that excrete urine."},
  {"word": "Brain", "meaning": "مغز", "description": "The organ inside the head that controls thought, memory, and feeling."},
  {"word": "Skin", "meaning": "پوست", "description": "The thin layer of tissue forming the natural outer covering of the body."},
  {"word": "Muscle", "meaning": "عضله", "description": "A band of fibrous tissue that has the ability to contract."},
  {"word": "Bone", "meaning": "استخوان", "description": "Any of the pieces of hard, whitish tissue making up the skeleton."},
  {"word": "Blood", "meaning": "خون", "description": "The red liquid that circulates in the arteries and veins."},
  {"word": "Vein", "meaning": "رگ", "description": "A vessel carrying blood to the heart."},
  {"word": "Artery", "meaning": "سرخرگ", "description": "A vessel carrying blood away from the heart."},
  {"word": "Nerve", "meaning": "عصب", "description": "A whitish fiber that transmits impulses of sensation to the brain."},
  {"word": "Spine", "meaning": "ستون فقرات", "description": "The series of vertebrae extending from the skull to the small of the back."},
  {"word": "Rib", "meaning": "دنده", "description": "Each of a series of slender curved bones articulated to the spine."},
  {"word": "Skull", "meaning": "جمجمه", "description": "The bony framework of the head enclosing the brain."}
]
