[
  {"word": "Bread", "meaning": "نان", "description": "A staple food prepared from a dough of flour and water, usually by baking."},
  {"word": "Rice", "meaning": "برنج", "description": "The starchy seeds of a cereal grass that are cooked and used for food."},
  {"word": "Pasta", "meaning": "پاستا", "description": "A dish originally from Italy consisting of dough made from durum wheat and water, extruded or stamped into various shapes."},
  {"word": "Cheese", "meaning": "پنیر", "description": "A food derived from milk that is produced in a wide range of flavors, textures, and forms by coagulation of the milk protein casein."},
  {"word": "Butter", "meaning": "کره", "description": "A dairy product made by churning fresh or fermented cream or milk."},
  {"word": "Egg", "meaning": "تخم مرغ", "description": "An oval or round object laid by a female bird, reptile, fish, or invertebrate, often eaten as food."},
  {"word": "Chicken", "meaning": "مرغ", "description": "The flesh of a chicken used as food."},
  {"word": "Beef", "meaning": "گوشت گاو", "description": "The flesh of a cow, bull, or ox, used as food."},
  {"word": "Fish", "meaning": "ماهی", "description": "The flesh of fish used as food."},
  {"word": "Lamb", "meaning": "گوشت بره", "description": "The flesh of a young sheep used as food."},
  {"word": "Apple", "meaning": "سیب", "description": "A round fruit with red, green, or yellow skin and crisp flesh."},
  {"word": "Banana", "meaning": "موز", "description": "A long curved fruit with a yellow skin and soft sweet flesh."},
  {"word": "Orange", "meaning": "پرتقال", "description": "A round juicy citrus fruit with a tough bright reddish-yellow rind."},
  {"word": "Strawberry", "meaning": "توت فرنگی", "description": "A sweet soft red fruit with a seed-studded surface."},
  {"word": "Chocolate", "meaning": "شکلات", "description": "A food preparation in the form of a paste or solid block made from roasted and ground cacao seeds."},
  {"word": "Cake", "meaning": "کیک", "description": "An item of soft sweet food made from a mixture of flour, fat, eggs, sugar, and other ingredients, baked and sometimes iced or decorated."},
  {"word": "Cookie", "meaning": "بیسکویت", "description": "A small sweet cake, typically round, flat, and crisp."},
  {"word": "Ice Cream", "meaning": "بستنی", "description": "A sweet frozen food made from dairy products, such as milk and cream, combined with flavorings and sweeteners."},
  {"word": "Pizza", "meaning": "پیتزا", "description": "A dish of Italian origin consisting of a flat, round base of dough baked with a topping of tomato sauce and cheese."},
  {"word": "Hamburger", "meaning": "همبرگر", "description": "A round patty of ground beef, fried or grilled and typically served on a bun or roll."},
  {"word": "Salad", "meaning": "سالاد", "description": "A cold dish of various mixtures of raw or cooked vegetables, usually seasoned with oil, vinegar, or other dressing."},
  {"word": "Soup", "meaning": "سوپ", "description": "A liquid dish, typically made by boiling meat, fish, or vegetables, etc., in stock or water."},
  {"word": "Sandwich", "meaning": "ساندویچ", "description": "An item of food consisting of two pieces of bread with meat, cheese, or other filling between them."},
  {"word": "Sushi", "meaning": "سوشی", "description": "A Japanese dish consisting of small balls or rolls of vinegar-flavored cold rice served with a garnish of raw fish, vegetables, or egg."},
  {"word": "Steak", "meaning": "استیک", "description": "A slice of meat, typically beef, usually cooked by grilling or frying."},
  {"word": "Kebab", "meaning": "کباب", "description": "A dish of pieces of meat, fish, or vegetables roasted or grilled on a skewer or spit."},
  {"word": "Yogurt", "meaning": "ماست", "description": "A semi-solid food prepared from milk fermented by added bacteria."},
  {"word": "Honey", "meaning": "عسل", "description": "A sweet, sticky, yellowish-brown fluid made by bees from nectar collected from flowers."},
  {"word": "Jam", "meaning": "مربا", "description": "A sweet spread or preserve made from fruit and sugar boiled to a thick consistency."},
  {"word": "Olive Oil", "meaning": "روغن زیتون", "description": "A liquid fat obtained from olives, used in cooking and salad dressings."},
  {"word": "Vinegar", "meaning": "سرکه", "description": "A sour-tasting liquid containing acetic acid, obtained by fermenting dilute alcoholic liquids."},
  {"word": "Salt", "meaning": "نمک", "description": "A white crystalline substance that gives seawater its characteristic taste."},
  {"word": "Sugar", "meaning": "شکر", "description": "A sweet crystalline substance obtained from various plants, especially sugar cane and sugar beet."},
  {"word": "Flour", "meaning": "آرد", "description": "A powder obtained by grinding grain, typically wheat, and used to make bread, cakes, and pastry."},
  {"word": "Noodles", "meaning": "نودل", "description": "A strip, ring, or tube of pasta or a similar dough, typically made with egg and usually eaten with a sauce or in a soup."},
  {"word": "Peanut Butter", "meaning": "کره بادام زمینی", "description": "A paste made from ground, dry-roasted peanuts."},
  {"word": "Popcorn", "meaning": "پاپ کورن", "description": "A type of corn that expands from the kernel and puffs up when heated."},
  {"word": "Pancake", "meaning": "پنکیک", "description": "A thin, flat cake of batter, fried on both sides in a pan and typically rolled up with a sweet or savory filling."},
  {"word": "Omelette", "meaning": "املت", "description": "A dish of beaten eggs cooked in a frying pan until firm, often with a filling added."},
  {"word": "Cereal", "meaning": "غلات", "description": "A grain used for food, such as wheat, oats, or corn."}
]
