[
  {"word": "Stop Sign", "meaning": "علامت توقف", "description": "A red octagonal sign that requires drivers to come to a complete stop."},
  {"word": "Yield", "meaning": "علامت حق تقدم", "description": "A red and white triangular sign that means you must let other traffic go first."},
  {"word": "Speed Limit", "meaning": "علامت محدودیت سرعت", "description": "A white rectangular sign with black numbers indicating the maximum legal speed."},
  {"word": "No Entry", "meaning": "ورود ممنوع", "description": "A red circular sign with a white horizontal bar, prohibiting vehicles from entering."},
  {"word": "One Way", "meaning": "خيابان يكطرفه", "description": "A white rectangular arrow on a blue or black background indicating traffic flows in one direction only."},
  {"word": "No U-Turn", "meaning": "دورزدن ممنوع", "description": "A red circular sign with a black U-turn arrow crossed out, prohibiting vehicles from turning around."},
  {"word": "No Parking", "meaning": "توقف ممنوع", "description": "A blue circular sign with a red border and cross, indicating parking is not allowed."},
  {"word": "Pedestrian Crossing", "meaning": "عبور عابر پياده", "description": "A white triangle with a black symbol of a person walking, indicating a crosswalk ahead."},
  {"word": "School Zone", "meaning": "منطقه مدرسه", "description": "A yellow sign with a symbol of children, indicating reduced speed limits near a school."},
  {"word": "Railroad Crossing", "meaning": "عبور راه آهن", "description": "A round yellow sign with a black X and letters RR, warning of a railroad crossing ahead."},
  {"word": "Slippery When Wet", "meaning": "لغزنده هنگام خيس بودن", "description": "A yellow diamond sign with a symbol of a car with wavy lines, warning that the road is slippery when wet."},
  {"word": "Deer Crossing", "meaning": "عبور حيوانات", "description": "A yellow diamond sign with a symbol of a deer, warning that animals may cross the road."},
  {"word": "Road Work Ahead", "meaning": "كارگاه راه", "description": "An orange diamond sign with a symbol of a worker digging, warning of construction ahead."},
  {"word": "Merge", "meaning": "ادغام ترافيك", "description": "A yellow diamond sign with two arrows coming together, warning that two lanes of traffic will become one."},
  {"word": "Divided Highway", "meaning": "جاده جدا شده", "description": "A yellow diamond sign indicating the road ahead has a median or barrier dividing traffic."},
  {"word": "Sharp Curve", "meaning": "پیچ تند", "description": "A yellow diamond sign with a curved arrow, warning of a sharp turn in the road ahead."},
  {"word": "Steep Hill", "meaning": "سرازیری", "description": "A yellow diamond sign with a symbol of a truck on a slope, warning of a steep hill ahead."},
  {"word": "No Passing Zone", "meaning": "سبقت ممنوع", "description": "A yellow pennant-shaped sign indicating that passing other vehicles is prohibited."},
  {"word": "Handicap Parking", "meaning": "جا پارو معلولين", "description": "A white sign with a blue symbol of a wheelchair, reserving parking for individuals with disabilities."},
  {"word": "Roundabout", "meaning": "ميدان", "description": "A yellow circular sign with three arrows forming a circle, indicating a circular intersection ahead."},
  {"word": "Bump", "meaning": "دست انداز", "description": "A yellow diamond sign warning of a sudden bump or dip in the road."},
  {"word": "Falling Rocks", "meaning": "سقوط سنگ", "description": "A yellow diamond sign with a symbol of rocks falling, warning of potential rock slides."},
  {"word": "T-Intersection", "meaning": "تقاطع T شكل", "description": "A yellow diamond sign indicating the road ahead ends and you must turn left or right."},
  {"word": "Two-Way Traffic", "meaning": "ترافيك دوطرفه", "description": "A yellow diamond sign warning that a one-way road is about to become two-way."},
  {"word": "Low Clearance", "meaning": "ارتفاع محدود", "description": "A yellow diamond sign indicating the maximum height allowed under a bridge or overpass."},
  {"word": "No Horn", "meaning": "بوق ممنوع", "description": "A sign prohibiting the use of a vehicle's horn in that area."},
  {"word": "Hump", "meaning": "سرعت کاه", "description": "A sign warning of a raised area in the road designed to reduce speed."},
  {"word": "Keep Right", "meaning": "راست بران", "description": "A sign instructing drivers to pass an obstacle on the right side."},
  {"word": "Dead End", "meaning": "بن بست", "description": "A sign indicating that the road does not continue through and has no exit."},
  {"word": "Give Way", "meaning": "عبور بدهيد", "description": "A sign instructing drivers to prepare to stop if necessary to let another driver proceed."}
]
